# DS 03 데이터분석

* Series
* DataFrames
* 누락된 데이타처리
* 기본 연산

# Series

In [1]:
mport pandas as pd

In [2]:
data_1 = ['a','b','c']
data_2 = [10,20,30]
data_3 = {'a':10,'b':20,'c':30}

In [3]:
data_1

['a', 'b', 'c']

In [4]:
data_2[1]

20

** 리스트로 시리즈 만들기 **

In [5]:
pd.Series(data=data_2)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(data=data_2,index=data_1)

a    10
b    20
c    30
dtype: int64

# pd.Series(리스트,레이블)

** 딕셔너리**

In [8]:
pd.Series(data_3)

a    10
b    20
c    30
dtype: int64

** 시리즈에 넣을수 있는 데이타는 숫자만이 아니다 **

In [5]:
레이블

['a', 'b', 'c']

In [7]:
pd.Series(data=레이블)

0    a
1    b
2    c
dtype: object

In [7]:
aaa = ['i','j','k']

In [9]:
pd.Series(data=레이블,index=aaa)

i    a
j    b
k    c
dtype: object

## 인덱스 사용하기

In [10]:
ser1 = pd.Series(리스트,index=레이블)

In [11]:
ser1

a    10
b    20
c    30
dtype: int64

In [10]:
ser1['a']

10

In [11]:
ser1[0]

10

In [12]:
ser2 = pd.Series([10,20,30,40,50],index=['a','c','d','e','f'])

In [14]:
ser1

a    10
b    20
c    30
dtype: int64

In [13]:
ser2

a    10
c    20
d    30
e    40
f    50
dtype: int64

In [13]:
ser1 + ser2

a    20.0
b     NaN
c    50.0
d     NaN
e     NaN
f     NaN
dtype: float64

In [15]:
ser2 - ser1

a     0.0
b     NaN
c   -10.0
d     NaN
e     NaN
f     NaN
dtype: float64

---

# 데이타프레임(DataFrame)

In [9]:
import pandas as pd
import numpy as np

In [10]:
from numpy.random import randn
np.random.seed(1004)
data = randn(5,4)
data

array([[ 0.59440307,  0.40260871, -0.80516223,  0.1151257 ],
       [-0.75306522, -0.7841178 ,  1.46157577,  1.57607553],
       [-0.17131776, -0.91448182,  0.86013945,  0.35880192],
       [ 1.72965706, -0.49764822,  1.7618699 ,  0.16901308],
       [-1.08523701, -0.01065175,  1.11579838, -1.26497153]])

In [11]:
df = pd.DataFrame(data,index='A B C D E'.split(),columns='가 나 다 라'.split())

In [25]:
df

          가         나         다         라
A  0.594403  0.402609 -0.805162  0.115126
B -0.753065 -0.784118  1.461576  1.576076
C -0.171318 -0.914482  0.860139  0.358802
D  1.729657 -0.497648  1.761870  0.169013
E -1.085237 -0.010652  1.115798 -1.264972

## 부분 선택하기

In [12]:
df['나']

A    0.402609
B   -0.784118
C   -0.914482
D   -0.497648
E   -0.010652
Name: 나, dtype: float64

In [28]:
df[['나','라']]

          나         라
A  0.402609  0.115126
B -0.784118  1.576076
C -0.914482  0.358802
D -0.497648  0.169013
E -0.010652 -1.264972

In [29]:
# 사용 할 수는 있으나 권장하지는 않음
df.나

A    0.402609
B   -0.784118
C   -0.914482
D   -0.497648
E   -0.010652
Name: 나, dtype: float64

In [21]:
type(df['나'])

pandas.core.series.Series

** 새로운 컬럼 **

In [13]:
df['합'] = df['나'] + df['다']

In [14]:
df

          가         나         다         라         합
A  0.594403  0.402609 -0.805162  0.115126 -0.402554
B -0.753065 -0.784118  1.461576  1.576076  0.677458
C -0.171318 -0.914482  0.860139  0.358802 -0.054342
D  1.729657 -0.497648  1.761870  0.169013  1.264222
E -1.085237 -0.010652  1.115798 -1.264972  1.105147

** 컬럼 삭제**

In [15]:
df.drop('합',axis=1)

          가         나         다         라
A  0.594403  0.402609 -0.805162  0.115126
B -0.753065 -0.784118  1.461576  1.576076
C -0.171318 -0.914482  0.860139  0.358802
D  1.729657 -0.497648  1.761870  0.169013
E -1.085237 -0.010652  1.115798 -1.264972

In [40]:
# inplace 파라메터를 사용하지 않으면 결과만 보여주고 원본은 원래대로..
df

          가         나         다         라         합
A  0.594403  0.402609 -0.805162  0.115126 -0.402554
B -0.753065 -0.784118  1.461576  1.576076  0.677458
C -0.171318 -0.914482  0.860139  0.358802 -0.054342
D  1.729657 -0.497648  1.761870  0.169013  1.264222
E -1.085237 -0.010652  1.115798 -1.264972  1.105147

In [42]:
df.drop('합',axis=1,inplace=True)

In [43]:
df

          가         나         다         라
A  0.594403  0.402609 -0.805162  0.115126
B -0.753065 -0.784118  1.461576  1.576076
C -0.171318 -0.914482  0.860139  0.358802
D  1.729657 -0.497648  1.761870  0.169013
E -1.085237 -0.010652  1.115798 -1.264972

In [53]:
df.drop('E',axis=0,inplace=True)

In [54]:
df

          가         나         다         라
A  0.594403  0.402609 -0.805162  0.115126
B -0.753065 -0.784118  1.461576  1.576076
C -0.171318 -0.914482  0.860139  0.358802
D  1.729657 -0.497648  1.761870  0.169013

** 열(row) 선택**

In [47]:
df['가']

A    0.594403
B   -0.753065
C   -0.171318
D    1.729657
E   -1.085237
Name: 가, dtype: float64

In [48]:
df.loc['A']

가    0.594403
나    0.402609
다   -0.805162
라    0.115126
Name: A, dtype: float64

In [49]:
df.iloc[2]

가   -0.171318
나   -0.914482
다    0.860139
라    0.358802
Name: C, dtype: float64

In [51]:
df.loc['B','다']

1.4615757677502899

In [32]:
df.loc[['A','B'],['나','다']]

          나         다
A -1.334294  0.009791
B  0.142506  0.993657

### 조건 선택

In [55]:
df

          가         나         다         라
A  0.594403  0.402609 -0.805162  0.115126
B -0.753065 -0.784118  1.461576  1.576076
C -0.171318 -0.914482  0.860139  0.358802
D  1.729657 -0.497648  1.761870  0.169013

In [56]:
df>1

       가      나      다      라
A  False  False  False  False
B  False  False   True   True
C  False  False  False  False
D   True  False   True  False

In [60]:
df[df>1]

          가   나         다         라
A       NaN NaN       NaN       NaN
B       NaN NaN  1.461576  1.576076
C       NaN NaN       NaN       NaN
D  1.729657 NaN  1.761870       NaN

In [61]:
df[df['다']>1]

          가         나         다         라
B -0.753065 -0.784118  1.461576  1.576076
D  1.729657 -0.497648  1.761870  0.169013

In [63]:
df[df['가']>0]

          가         나         다         라
A  0.594403  0.402609 -0.805162  0.115126
D  1.729657 -0.497648  1.761870  0.169013

In [64]:
df[df['가']>0]['라']

A    0.115126
D    0.169013
Name: 라, dtype: float64

In [65]:
df[df['가']>0][['다','라']]

          다         라
A -0.805162  0.115126
D  1.761870  0.169013

In [66]:
df[(df['가']>0) & (df['나'] > 1)]

Empty DataFrame
Columns: [가, 나, 다, 라]
Index: []

## 인덱스 관련 추가사항

In [67]:
df

          가         나         다         라
A  0.594403  0.402609 -0.805162  0.115126
B -0.753065 -0.784118  1.461576  1.576076
C -0.171318 -0.914482  0.860139  0.358802
D  1.729657 -0.497648  1.761870  0.169013

In [74]:
# Reset to default 0,1...n index
df.reset_index()

  index         가         나         다         라
0     A  0.594403  0.402609 -0.805162  0.115126
1     B -0.753065 -0.784118  1.461576  1.576076
2     C -0.171318 -0.914482  0.860139  0.358802
3     D  1.729657 -0.497648  1.761870  0.169013

In [76]:
새인덱스 = '하나 둘 셋 넷'.split()

In [77]:
df['숫자'] = 새인덱스

In [78]:
df

          가         나         다         라  숫자
A  0.594403  0.402609 -0.805162  0.115126  하나
B -0.753065 -0.784118  1.461576  1.576076   둘
C -0.171318 -0.914482  0.860139  0.358802   셋
D  1.729657 -0.497648  1.761870  0.169013   넷

In [79]:
df.set_index('숫자')

           가         나         다         라
숫자
하나  0.594403  0.402609 -0.805162  0.115126
둘  -0.753065 -0.784118  1.461576  1.576076
셋  -0.171318 -0.914482  0.860139  0.358802
넷   1.729657 -0.497648  1.761870  0.169013

In [80]:
df

          가         나         다         라  숫자
A  0.594403  0.402609 -0.805162  0.115126  하나
B -0.753065 -0.784118  1.461576  1.576076   둘
C -0.171318 -0.914482  0.860139  0.358802   셋
D  1.729657 -0.497648  1.761870  0.169013   넷

In [81]:
df.set_index('숫자',inplace=True)

In [82]:
df

           가         나         다         라
숫자
하나  0.594403  0.402609 -0.805162  0.115126
둘  -0.753065 -0.784118  1.461576  1.576076
셋  -0.171318 -0.914482  0.860139  0.358802
넷   1.729657 -0.497648  1.761870  0.169013

---

# 데이타가 없는경우 처리방법

In [83]:
import numpy as np
import pandas as pd

In [84]:
df = pd.DataFrame({'A':[1,2,np.nan],
                   'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [86]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [88]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [89]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [90]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [54]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [55]:
df.fillna(value='임의의 값')

       A      B  C
0      1      5  1
1      2  임의의 값  2
2  임의의 값  임의의 값  3

In [56]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

---

# Groupby

In [94]:
import pandas as pd
data = {'회사':['구글','구글','애플','애플','아마존','아마존'],
       '이름':['김씨','이씨','박씨','최씨','장씨','마씨'],
       '매출':[200,120,340,124,243,350]}

In [95]:
df = pd.DataFrame(data)

In [97]:
df

    매출  이름   회사
0  200  김씨   구글
1  120  이씨   구글
2  340  박씨   애플
3  124  최씨   애플
4  243  장씨  아마존
5  350  마씨  아마존

In [98]:
df.groupby('회사')

In [99]:
by_comp = df.groupby("회사")

In [100]:
by_comp.mean()

        매출
회사
구글   160.0
아마존  296.5
애플   232.0

In [102]:
df.groupby('회사').mean()

        매출
회사
구글   160.0
아마존  296.5
애플   232.0

In [103]:
by_comp.std()

             매출
회사
구글    56.568542
아마존   75.660426
애플   152.735065

In [104]:
by_comp.min()

      매출  이름
회사
구글   120  김씨
아마존  243  마씨
애플   124  박씨

In [105]:
by_comp.max()

      매출  이름
회사
구글   200  이씨
아마존  350  장씨
애플   340  최씨

In [106]:
by_comp.count()

     매출  이름
회사
구글    2   2
아마존   2   2
애플    2   2

In [109]:
df

    매출  이름   회사
0  200  김씨   구글
1  120  이씨   구글
2  340  박씨   애플
3  124  최씨   애플
4  243  장씨  아마존
5  350  마씨  아마존

In [108]:
df.describe()

               매출
count    6.000000
mean   229.500000
std    100.899455
min    120.000000
25%    143.000000
50%    221.500000
75%    315.750000
max    350.000000

In [107]:
by_comp.describe()

                   매출
회사
구글  count    2.000000
    mean   160.000000
    std     56.568542
    min    120.000000
    25%    140.000000
    50%    160.000000
    75%    180.000000
    max    200.000000
아마존 count    2.000000
    mean   296.500000
    std     75.660426
    min    243.000000
    25%    269.750000
    50%    296.500000
    75%    323.250000
    max    350.000000
애플  count    2.000000
    mean   232.000000
    std    152.735065
    min    124.000000
    25%    178.000000
    50%    232.000000
    75%    286.000000
    max    340.000000

---

# 연산

In [110]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### unique

In [112]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [113]:
df['col2'].nunique()

3

In [114]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### 테이타 값으로 선택

In [115]:
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [116]:
newdf

   col1  col2 col3
3     4   444  xyz

### Apply

In [120]:
def 제곱(x):
    return x*x

In [121]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [122]:
df['col1'].apply(제곱)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [124]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [125]:
df['col1'].sum()

10

In [127]:
df.sum(axis=1)

0    445
1    557
2    669
3    448
dtype: int64

** 컬럼 삭제(영구적)**

In [128]:
del df['col1']

In [129]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** 컬럼명과 인덱스명 **

In [130]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [133]:
df.columns = ['하나','둘']

In [134]:
df

    하나    둘
0  444  abc
1  555  def
2  666  ghi
3  444  xyz

In [131]:
df.index

RangeIndex(start=0, stop=4, step=1)

** 정렬 **

In [135]:
df

    하나    둘
0  444  abc
1  555  def
2  666  ghi
3  444  xyz

In [138]:
df.sort_values(by='하나', inplace=False)

    하나    둘
0  444  abc
3  444  xyz
1  555  def
2  666  ghi

** 비어 있는 값 체크 **

In [140]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [141]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [142]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [143]:
df.dropna()

     A    B  C
0  1.0  5.0  1

---

In [96]:
student =pd.DataFrame({'수학':[90,80,70],
                       '영어':[98,89,95],
                       '음악':[85,95,100],
                       '체육':[100,90,90]},index=['서준','우현','인아'])

In [97]:
student

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [98]:
student.drop('수학', axis = 1, inplace = True)

In [99]:
student

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [100]:
student[student['음악']> 90]

    영어   음악  체육
우현  89   95  90
인아  95  100  90

In [101]:
student

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [102]:
student['총점'] = student['영어']+student['음악']+student['체육']

In [103]:
student

    영어   음악   체육   총점
서준  98   85  100  283
우현  89   95   90  274
인아  95  100   90  285

In [104]:
student['평균'] = (student['영어'] + student['음악'] + student['체육'])/3

In [105]:
student

    영어   음악   체육   총점         평균
서준  98   85  100  283  94.333333
우현  89   95   90  274  91.333333
인아  95  100   90  285  95.000000

In [110]:
stu1 = student.loc['서준','음악']

In [111]:
print(stu1)

85

# 데이타 입력 / 출력

In [87]:
import numpy as np
import pandas as pd

## CSV

In [144]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [ ]:
df2 =

In [145]:
df.to_csv('example2',index=False)

## Excel

In [146]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [147]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='Sheet1')

## HTML

In [148]:
df = pd.read_html('http://finance.naver.com/item/sise.nhn?code=089030')

In [149]:
df

[                    0                                        1  \
 0  전일  21,250  21,250  고가  21,50021,500  (상한가  27,60027,600  )
 1    시가  21,45021,450        저가  21,05021,050  (하한가  14,900  )

                         2
 0     거래량  77,786  77,786
 1  거래대금  1,653  1,653  백만  ,           0        1       2         3
 0       현재가    21300    매도호가     21300
 1      전일대비   상승  50    매수호가     21250
 2    등락률(%)   +0.24%     전일가     21250
 3       거래량    77786      시가     21450
 4   거래대금(천)     1653      고가     21500
 5       액면가     500원      저가     21050
 6       NaN      NaN     NaN       NaN
 7       상한가    27600    전일상한     27300
 8       하한가    14900    전일하한     14700
 9       PER    10.16     EPS      2096
 10   52주 최고    22300  52주 최저     11100
 11     시가총액  3,921억원   상장주식수  18408508
 12    외국인현재  2,295천주     자본금   9,267백만,        0      1   2      3     4
 0   매도잔량   매도호가 NaN   매수호가  매수잔량
 1    NaN    NaN NaN    NaN   NaN
 2    753  21500 NaN    NaN   NaN
 3   1681  21450 NaN    NaN   NaN
 4   1644  21400 NaN    NaN   NaN
 5    663  21350 NaN    NaN   NaN
 6    308  21300 NaN    NaN   NaN
 7    NaN    NaN NaN    NaN   NaN
 8    NaN    NaN NaN    NaN   NaN
 9    NaN    NaN NaN    NaN   NaN
 10   NaN    NaN NaN  21250   103
 11   NaN    NaN NaN  21200  2001
 12   NaN    NaN NaN  21150     1
 13   NaN    NaN NaN  21100     1
 14   NaN    NaN NaN  21050  1870
 15   NaN    NaN NaN    NaN   NaN,       0     1     2
 0  9597  잔량합계  6753,                                                    0                   1
 0                                               시가총액           3,921  억원
 1                                             시가총액순위            코스닥 145위
 2                                              상장주식수            18408508
 3                                           액면가l매매단위         500원  l  1주
 4  주총일l전자투표  전자투표제란?  전자투표제란 주주가 온라인을 통해 의결권등을 행사...  2018.03.26  l  미도입,                                                    0         1
 0                                        외국인한도주식수(A)  18408508
 1                                        외국인보유주식수(B)   2294705
 2  외국인소진율(B/A)  외국인(한도)소진율이란 외국인보유주식수를 외국인한도주식수으로...    12.47%,            0                  1
 0  투자의견l목표주가  4.00매수  l  26,600
 1   52주최고l최저  22,300  l  11,100,                                                    0                  1
 0  PERlEPS(WISEfn)  PER(WISEfn) = 현재가÷EPS(WISEfn)...  10.16배  l  2,096원,           0       1
 0  동일업종 PER  15.06배
 1  동일업종 등락률  +0.52%,        0          1     2
 0   매도잔량  호가(20분지연)  매수잔량
 1    NaN        NaN   NaN
 2   1819      21750   NaN
 3    600      21700   NaN
 4    653      21650   NaN
 5   1058      21600   NaN
 6    418      21550   NaN
 7    753      21500   NaN
 8   1681      21450   NaN
 9   1644      21400   NaN
 10   663      21350   NaN
 11   308      21300   NaN
 12   NaN        NaN   NaN
 13   NaN      21250   103
 14   NaN      21200  2001
 15   NaN      21150     1
 16   NaN      21100     1
 17   NaN      21050  1870
 18   NaN      21000  1256
 19   NaN      20950   417
 20   NaN      20900   295
 21   NaN      20850   590
 22   NaN      20800   219
 23   NaN        NaN   NaN
 24  9597       잔량합계  6753,         업체명        거래량         전일비
 0     금호타이어     4615.0  상한가  1,065
 1      삼성전자  2461000.0   상향  9,000
 2     NAVER   792000.0   상향  6,000
 3      셀트리온   309500.0   하향  7,500
 4      인스코비     9610.0     상향  970
 5       NaN        NaN         NaN
 6       파미셀    15700.0     상향  100
 7   SK이노베이션   211000.0   상향  1,000
 8     세원셀론텍     5780.0     상향  440
 9       카카오   132000.0   상향  2,500
 10      필룩스    20450.0     상향  200,        업체명       거래량         전일비
 0    차바이오텍   19700.0   하향  1,850
 1       안랩   85400.0     상향  500
 2    에이치엘비   70100.0   상향  4,100
 3     펄어비스  226700.0  상향  10,800
 4       켐온    2975.0    상한가  685
 5      NaN       NaN         NaN
 6       텔콘   15350.0   하향  1,450
 7     코아스템   19750.0   상향  2,100
 8    바이로메드  224900.0   상향  3,900
 9   바이오리더스   23100.0  상한가  5,300
 10     비덴트   15200.0     상향  750]